{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "fa45dccf-c9e5-4ae6-afff-61237c9c1814",
   "metadata": {},
   "source": [
    "Задача 1. Группировка по анаграммам\n",
    "Написать программу, которая принимает список слов и группирует их по анаграммам. Порядок слов в группах и порядок самих групп не имеет значения.\n",
    "\n",
    "Подумайте, какую структуру данных здесь оптимально использовать\n",
    "\n",
    "Анаграммы — это слова, состоящие из одних и тех же букв, но в разном порядке (например, \"nos\", \"son\", \"ons\").\n",
    "\n",
    "Примеры:\n",
    "\n",
    "words = [\"eat\", \"tea\", \"tan\", \"ate\", \"nat\", \"bat\"]\n",
    "Результат: [['eat', 'tea', 'ate'], ['tan', 'nat'], ['bat']]\n",
    "words = [\"nos\", \"son\", \"mac\", \"cam\", \"ons\"]\n",
    "Результат: [['nos', 'son', 'ons'], ['mac', 'cam']]\n",
    "words = [\"a\"]\n",
    "Результат: [['a']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "de4f09bb-3730-451e-bd8d-400513a6b2a3",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " eat bat\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['eat']\n",
      "['bat']\n"
     ]
    }
   ],
   "source": [
    "def group_anagrams(words):\n",
    "    groups = {}\n",
    "    for word in words:\n",
    "        key = ''.join(sorted(word))\n",
    "        if key in groups:\n",
    "            groups[key].append(word)\n",
    "        else:\n",
    "            groups[key] = [word]\n",
    "    return list(groups.values())\n",
    "input_words = input().split()\n",
    "result = group_anagrams(input_words)\n",
    "for group in result:\n",
    "    print(group)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9f919a2e-2b5c-4497-81a3-0e2a7e6db029",
   "metadata": {},
   "source": [
    "Задача 2. Шпионская Сеть\n",
    "У вас есть доступ к логам доступа к секретным документам. Логи представлены в виде списка кортежей (имя_агента, номер_документа). Написать программу, которая вернет множество имен агентов, имеющих доступ ко всем документам из списка required_docs.\n",
    "\n",
    "Примеры:\n",
    "\n",
    "access_logs = [(\"Alice\", \"doc1\"), (\"Bob\", \"doc2\"), (\"Alice\", \"doc2\"), (\"Charlie\", \"doc1\")]\n",
    "required_docs = {\"doc1\", \"doc2\"}\n",
    "\n",
    "Алиса имеет доступ к {\"doc1\", \"doc2\"}. Боб — к {\"doc2\"}. Чарли — к {\"doc1\"}.\n",
    "Только Алиса имеет доступ ко всем требуемым документам.\n",
    "Результат: {\"Alice\"}\n",
    "\n",
    "******************************\n",
    "\n",
    "access_logs = [(\"Agent_X\", \"plan_A\"), (\"Agent_Y\", \"plan_B\"), (\"Agent_X\", \"plan_B\")]\n",
    "required_docs = {\"plan_A\", \"plan_B\", \"plan_C\"}\n",
    "\n",
    "Ни один агент не имеет доступа ко всем трем документам.\n",
    "Результат: set() (пустое множество)\n",
    "\n",
    "******************************\n",
    "\n",
    "access_logs = [(\"Anna\", \"file1\"), (\"Boris\", \"file2\"), (\"Anna\", \"file3\"), (\"Cyril\", \"file1\"), (\"Anna\", \"file2\")]\n",
    "required_docs = {\"file1\", \"file2\"}\n",
    "\n",
    "Анна имеет доступ к {\"file1\", \"file2\", \"file3\"}. Борис — к {\"file2\"}. Кирилл — к {\"file1\"}.\n",
    "Доступ Анны ({\"file1\", \"file2\", \"file3\"}) включает в себя все требуемые документы ({\"file1\", \"file2\"}).\n",
    "Результат: {\"Anna\"}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a419a0fa-d8f3-4ab3-9410-ab55477200a5",
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_agents(access_logs, required_docs):\n",
    "\n",
    "    agent_docs = {}\n",
    "\n",
    "    for agent, doc in access_logs:\n",
    "        if agent in agent_docs:\n",
    "            agent_docs[agent].add(doc)\n",
    "        else:\n",
    "            agent_docs[agent] = {doc}\n",
    "    \n",
    "   \n",
    "    result = set()\n",
    "    for agent, docs in agent_docs.items():\n",
    "        if required_docs.issubset(docs):\n",
    "            result.add(agent)\n",
    "    \n",
    "    return result\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4f15377a-b703-4a0f-b494-6c1d1cb8adbb",
   "metadata": {},
   "source": [
    "Задача 3. Обратный индекс\n",
    "Обратный индекс - это структура, которая используется для поиска в массивах данных.\n",
    "\n",
    "Вам нужно написать программу, которая принимает список документов (документ — это строка) и должна построить \"обратный индекс\". Это словарь, где:\n",
    "\n",
    "ключ — это слово (в нижнем регистре).\n",
    "значение — это множество индексов документов, в которых это слово встречается.\n",
    "Пример:\n",
    "\n",
    "docs = [\n",
    "\"Python is a great language\",  # doc 0\n",
    "\"Java is also a great language\", # doc 1\n",
    "\"Python and Java are popular\"    # doc 2\n",
    "]\n",
    "\n",
    "Результат (порядок ключей не важен)\n",
    "\n",
    "{\n",
    "  \"python\": {0, 2},\n",
    "  \"is\": {0, 1},\n",
    "  \"a\": {0, 1},\n",
    "  \"great\": {0, 1},\n",
    "  \"language\": {0, 1},\n",
    "  \"java\": {1, 2},\n",
    "  \"also\": {1},\n",
    "  \"and\": {2},\n",
    "  \"are\": {2},\n",
    "  \"popular\": {2}\n",
    "}\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4d320350-2020-40c9-913d-e2bbc7b48e89",
   "metadata": {},
   "outputs": [],
   "source": [
    "def index(docs):\n",
    "    inverted_index = {}\n",
    "    \n",
    "    for doc_index, document in enumerate(docs):\n",
    "        words = document.split()\n",
    "        \n",
    "        for word in words:\n",
    "            word_lower = word.lower()\n",
    "            \n",
    "            if word_lower in inverted_index:\n",
    "                inverted_index[word_lower].add(doc_index)\n",
    "            else:\n",
    "                inverted_index[word_lower] = {doc_index}\n",
    "    \n",
    "    return inverted_index"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
